Repository: manhcuong5311-hue/EasySchedule
Catalog: Easy Schedule/Localizable.xcstrings
Source language: en
Languages: ja, ko, vi

# store_unavailable
source: Store not available on this device.
ja: この端末ではストアを利用できません。
ko: 이 기기에서는 스토어를 사용할 수 없습니다.
vi: Store không khả dụng trên thiết bị này.

# subscription_active_note
source: Your subscription is active and all premium features are unlocked.
ja: サブスクリプションは有効で、すべてのプレミアム機能が利用できます。
ko: 구독이 활성화되어 있으며 모든 프리미엄 기능을 사용할 수 있습니다.

# subscription_auto_renews
source: Subscription automatically renews unless canceled at least 24 hours before the end of the current period.
ja: サブスクリプションは、現在の期間終了24時間前までに解約しない限り自動更新されます。
ko: 현재 기간 종료 24시간 전까지 취소하지 않으면 구독이 자동으로 갱신됩니다.
vi: Gói đăng ký sẽ tự động gia hạn trừ khi bạn hủy ít nhất 24 giờ trước khi kết thúc chu kỳ hiện tại.

source: Success
ja: 成功しました
ko: 성공
vi: Thành công

# support_email_subject
source: Easy Schedule Support
ja: Easy Schedule サポート
ko: Easy Schedule 지원
vi: Hỗ trợ Easy Schedule

source: System
ja: システム
ko: 시스템

# tab_calendar
source: Calendar
ja: カレンダー
ko: 캘린더

# tab_events
source: Events
ja: イベント
ko: 이벤트
vi: Sự kiện

# tab_partners
source: Partners
ja: パートナー
ko: 파트너
vi: Đối tác

# tap_block_quick_select_hint
source: Tap a block to quick-select that hour. Long-press to see what's booked.
ja: ブロックをタップするとその時間をすばやく選択できます。長押しで予約状況を確認できます。
ko: 블록을 탭하면 해당 시간을 빠르게 선택할 수 있습니다. 길게 눌러 예약된 내용을 확인하세요.
vi: Nhấn vào ô để chọn nhanh giờ đó. Nhấn giữ để xem đã được đặt chưa.

source: Tasks
ja: タスク
ko: 작업
vi: Công việc

# terms_of_use
source: Term of use
ja: 利用規約
ko: 이용 약관
vi: Điều khoản sử dụng

source: This time slot is already booked!
ja: この時間枠はすでに予約されています！
ko: 이 시간대는 이미 예약되었습니다!
vi: Giờ này đã có người đặt!

# time_anchor_evening
source: Evening
ja: 夕方
ko: 저녁
vi: Buổi tối

# time_anchor_noon
source: Noon
ja: 昼
ko: 정오
vi: Buổi trưa

# time_color_label
source: Time color
ja: 時間の色
ko: 시간 색상
vi: Màu giờ

source: Time Conflict
ja: 時間の重複
ko: 시간 충돌

# time_countdown_in
source: In %d min
ja: %d分後
ko: %d분 후
vi: Còn %d phút

# time_display_anchor
source: Anchor (morning / afternoon)
ja: 時間帯（朝・午後）
ko: 시간대 (아침 / 오후)
vi: Mốc thời gian (sáng / chiều)

# time_display_section_title
source: Time display
ja: 時間表示
ko: 시간 표시

# time_display_timeline
source: Timeline (start–end)
ja: タイムライン（開始〜終了）
ko: 타임라인 (시작–종료)
vi: Dòng thời gian (bắt đầu–kết thúc)

# time_duration_minutes
source: %d min
ja: %d分
ko: %d분
vi: %d phút

# time_slot_taken
source: Time slot is taken!
ja: 時間枠が埋まっています！
ko: 해당 시간대는 사용 중입니다!
vi: Khung giờ bận!

# time_slots_30min
source: Time slots (30 minutes)
ja: 時間枠（30分）
ko: 시간대 (30분)
vi: Khung giờ (30 phút)

# time_unavailable
source: This time slot is busy or falls on a day off.
ja: この時間枠は予定あり、または休暇日に該当します。
ko: 이 시간대는 이미 일정이 있거나 휴무일에 해당합니다.
vi: Khung giờ này đã bận hoặc rơi vào ngày nghỉ.

# timeline_auto_expanded_hint
source: Timeline expanded to show all events
ja: すべての予定を表示するため、タイムラインを拡張しました
ko: 모든 이벤트를 표시하기 위해 타임라인이 확장되었습니다
vi: Dòng thời gian đã được mở rộng để hiển thị tất cả sự kiện

# title_calendar
source: Calendar
ja: カレンダー
ko: 캘린더
vi: của tôi

# title_partner
source: Partner
ja: 共有
ko: 공유
vi: Lịch

# title_partner1
source: Partner
ja: 共有
ko: 공유
vi: Lịch

# title_placeholder
source: Title
ja: タイトル
ko: 제목
vi: Tiêu đề

# title_section
source: Title
ja: タイトル
ko: 제목

source: Today only
ja: 本日のみ
ko: 오늘만
vi: Chỉ hôm nay

# todo_delete
source: Delete
ja: 削除
ko: 삭제

# todo_empty_message
source: Please enter a task before adding it.
ja: 追加する前にタスクを入力してください。
ko: 추가하기 전에 할 일을 입력해 주세요.
vi: Vui lòng nhập công việc trước khi thêm.

# todo_empty_title
source: Nothing to add
ja: 内容がありません
ko: 내용이 없습니다
vi: Chưa có nội dung

# todo_free_limit_message
source: Free users can create up to %d tasks. Upgrade to Premium to add more tasks.
ja: 無料ユーザーは最大%d件のタスクを作成できます。 Premiumにアップグレードすると、さらにタスクを追加できます。
ko: 무료 사용자는 최대 %d개의 작업을 생성할 수 있습니다. Premium으로 업그레이드하면 더 많은 작업을 추가할 수 있습니다.
vi: Người dùng miễn phí có thể tạo tối đa %d công việc. Nâng cấp lên Premium để tạo thêm công việc.

# todo_limit_reached_message
source: This event has reached the maximum number of tasks.
ja: このイベントのタスク数が上限に達しました。
ko: 이 이벤트의 할 일 수가 최대 한도에 도달했습니다.
vi: Sự kiện này đã đạt số lượng công việc tối đa.

# todo_limit_title
source: Todo limit reached
ja: タスクの上限に達しました
ko: 할 일 한도에 도달했습니다
vi: Đã đạt giới hạn.

# todo_list_title
source: Shared To-do list
ja: 共有ToDoリスト
ko: 공유 할 일 목록
vi: Danh sách To-do chung

# todo_mark_done
source: Mark as done
ja: 完了にする
ko: 완료로 표시
vi: Đánh dấu hoàn thành

# todo_pin
source: Pin
ja: 固定
ko: 고정

# too_fast
source: Too fast, please slow down.
ja: 操作が早すぎます。少し待ってください。
ko: 너무 빠르게 진행하고 있습니다. 잠시만 기다려 주세요.

source: Transaction unverified.
ja: 取引が検証できませんでした。
ko: 거래를 확인할 수 없습니다.
vi: Giao dịch chưa được xác minh.

# trial_days_format
source: %d-day free trial
ja: %d日間の無料トライアル
ko: %d일 무료 체험
vi: Dùng thử miễn phí %d ngày

source: UID copied
ja: UIDをコピーしました
ko: UID가 복사되었습니다
vi: Đã sao chép UID

# uid_not_verified
source: Please load and verify the calendar before creating an appointment.
ja: 予定を作成する前に、カレンダーを読み込み、確認してください。
ko: 약속을 생성하기 전에 캘린더를 불러오고 확인해 주세요.
vi: Vui lòng tải và xác minh lịch trước khi tạo cuộc hẹn.

# uid_required
source: Please load a shared UID before adding an appointment.
ja: 予定を追加する前に、共有UIDを読み込んでください。
ko: 일정을 추가하기 전에 공유 UID를 먼저 불러오세요.
vi: Vui lòng nhập UID được chia sẻ trước khi thêm lịch hẹn.

source: Unable to find root view controller.
ja: ルートビューコントローラが見つかりません。
ko: 루트 뷰 컨트롤러를 찾을 수 없습니다.

source: Unable to proceed
ja: 続行できません
ko: 계속할 수 없습니다
vi: Không thể tiếp tục

# unknown_uid
source: Cannot determine recipient UID.
ja: 受信者のUIDを特定できません。
ko: 수신자의 UID를 확인할 수 없습니다.
vi: Không xác định UID người nhận.

source: Unknown user
ja: 不明なユーザー
ko: 알 수 없는 사용자
vi: Người dùng không xác định

source: Unlimited
ja: 無制限
ko: 무제한
vi: Không giới hạn

# unlock_button
source: Unlock using Face ID / Touch ID
ja: Face ID / Touch IDでロック解除
ko: Face ID / Touch ID로 잠금 해제
vi: Mở khóa bằng Face ID / Touch ID

# unlock_reason
source: Authenticate to unlock the app
ja: アプリを解除するには認証してください
ko: 앱을 잠금 해제하려면 인증하세요
vi: Xác thực để mở khóa

source: Upcoming
ja: 今後
ko: 예정됨
vi: Sắp tới

# upcoming_event_message
source: Upcoming event: %@
ja: まもなく予定があります：%@
ko: 예정된 일정: %@
vi: Sự kiện sắp diễn ra: %@

source: Upgrade account
ja: アカウントをアップグレード
ko: 계정 업그레이드
vi: Nâng cấp tài khoản

# upgrade_premium_subtitle
source: Increase your limits and unlock advanced scheduling features.
ja: 制限を拡張し、高度なスケジュール機能を利用できます。
ko: 사용 한도를 늘리고 고급 일정 관리 기능을 이용하세요.
vi: Mở rộng giới hạn và kích hoạt các tính năng lập lịch nâng cao.

source: Upgrade to Premium
ja: プレミアムにアップグレード
ko: 프리미엄으로 업그레이드
vi: Nâng cấp Premium

# upgrade_todo_list_to_20
source: Upgrade this todo list to 20
ja: このリストを20件のタスクにアップグレード
ko: 이 할 일 목록을 20개로 업그레이드
vi: Nâng cấp danh sách này lên 20

source: Use custom time
ja: 時間をカスタマイズ
ko: 사용자 지정 시간 사용
vi: Dùng giờ tuỳ chỉnh

source: User cancelled.
ja: ユーザーがキャンセルしました。
ko: 사용자가 취소했습니다.
vi: Người dùng đã huỷ.

# user_not_premium
source: This user has not subscribed to Premium.
ja: このユーザーはプレミアムに登録していません。
ko: 이 사용자는 프리미엄에 가입하지 않았습니다.
vi: Người này chưa đăng kí Premium

# verify_email_message
source: Please verify your email before logging in. Check your inbox for the verification link.
ja: ログインする前にメールアドレスを確認してください。受信トレイに送信された確認リンクをご確認ください。
ko: 로그인하기 전에 이메일 인증을 완료해 주세요. 받은편지함에서 인증 링크를 확인하세요.
vi: Vui lòng xác minh email trước khi đăng nhập. Hãy kiểm tra hộp thư của bạn để nhận liên kết xác minh.

# verify_email_resend
source: Resend Verification Email
ja: 確認メールを再送する
ko: 인증 이메일 다시 보내기
vi: Gửi lại email xác minh

# verify_email_title
source: Email Verification Required
ja: メール確認が必要です
ko: 이메일 인증이 필요합니다
vi: Yêu cầu xác minh email

source: Vietnamese
ja: ベトナム語
ko: 베트남어

source: View and manage your calendar
ja: カレンダーを表示・管理します
ko: 캘린더를 보고 관리하세요
vi: Xem và quản lý lịch của bạn

source: View onboarding
ja: オンボーディングを見る
ko: 온보딩 다시 보기
vi: Xem giới thiệu

source: View weekly past events summary
ja: 過去1週間のイベント概要を表示
vi: Xem tổng hợp các sự kiện đã diễn ra trong tuần

source: Viewed history
ja: 閲覧履歴
ko: 조회 기록
vi: Lịch sử đã xem

# week_prefix
source: Week
ja: 週
ko: 주
vi: Tuần

# week_view_title
source: Week View
ja: 週表示
ko: 주간 보기
vi: Xem theo tuần

source: Welcome!
ja: ようこそ！
ko: 환영합니다!
vi: Chào mừng!

# welcome_logged_in
source: Welcome! You are now logged in.
ja: ようこそ！ログインが完了しました。
ko: 환영합니다! 로그인되었습니다.
vi: Chào mừng! Bạn đã đăng nhập.

# welcome_message
source: Welcome to Easy Schedule!
ja: Easy Scheduleへようこそ！
ko: Easy Schedule에 오신 것을 환영합니다!
vi: Chào mừng bạn đến với Easy Schedule!

# wrong_password
source: Incorrect password.
ja: パスワードが正しくありません。
ko: 비밀번호가 올바르지 않습니다.
vi: Mật khẩu không chính xác.

source: You
ja: あなた
ko: 나
vi: Bạn

source: You are offline please reconnect
ja: オフラインです。再接続してください。
ko: 오프라인 상태입니다. 다시 연결해 주세요.
vi: Bạn đang offline, vui lòng kết nối lại mạng.

source: You can only book within the next 7 days.
ja: 予約できるのは今後7日以内のみです。
ko: 앞으로 7일 이내만 예약할 수 있습니다.
vi: Bạn chỉ có thể đặt trong vòng 7 ngày tới.

source: You cant create this event.
ja: このイベントを作成できません。
ko: 이 이벤트를 생성할 수 없습니다.
vi: Bạn không thể tạo lịch này.

# you_have_event_this_time
source: You already have an event at this time.
ja: この時間帯にはすでに予定があります。
ko: 이 시간에는 이미 일정이 있습니다.

source: You need to log in.
ja: ログインが必要です。
ko: 로그인이 필요합니다.
vi: Vui lòng đăng nhập để tiếp tục.

# you_sure_sending_your_location
source: Are you sure sending your location?
ja: 現在地を送信してもよろしいですか？
ko: 현재 위치를 보내시겠습니까?
vi: Bạn có muốn gửi vị trí của mình?

# availability_busy_time
source: 2:00 – 4:00 PM
ko: 오후 2:00–4:00

# email_not_verified_message
source: Please verify your email before logging in.
ko: 로그인하기 전에 이메일을 인증해 주세요.

source: Failed to create event
ko: 이벤트 생성에 실패했습니다

# faq_2_q
source: How can others view my calendar?
ko: 다른 사람은 어떻게 내 캘린더를 볼 수 있나요?

source: Ok
ko: 확인

source: Remove access
ko: 접근 권한 제거

# day_off_badge
source: Day Off
vi: Ngày nghỉ

# day_off_tile_hint
source: Tap to mark this day as unavailable for bookings
vi: Nhấn để đánh dấu ngày này không nhận lịch

# day_off_tile_hint_active
source: This day is off — tap to reopen for bookings
vi: Ngày này đang nghỉ — nhấn để mở lại nhận lịch

# delete_event_prefix
source: Are you sure you want to delete this event?
vi: Bạn có chắc muốn xoá?

# error_invalid_credentials
source: Invalid login credentials.
vi: Thông tin đăng nhập không hợp lệ.

# error_invalid_email
source: Invalid email address.
vi: Email không hợp lệ.

# error_wrong_password
source: Incorrect password.
vi: Mật khẩu không đúng.

# faq_busy_hours_a
source: Busy hours let you mark time periods when you are unavailable. These times help prevent scheduling conflicts even if no events exist. Busy hours are different from days off and can be edited anytime.
vi: Giờ bận cho phép bạn đánh dấu các khoảng thời gian bạn không rảnh. Những khoảng này sẽ được dùng để tránh đặt lịch trùng, ngay cả khi không có sự kiện nào. Giờ bận khác với ngày nghỉ và có thể chỉnh sửa bất cứ lúc nào.

# light_suggestion_subtitle
source: Make the most of your day by planning it more thoughtfully.
vi: Hãy tận dụng một ngày tuyệt vời bằng cách lên kế hoạch thông minh hơn.

# onboarding_realtime_sync
source: Real-time sync
vi: Đồng bộ theo thời gian thực

# onboarding_title_1
source: Made for two people
vi: Dành riêng cho hai người

# privacy_policy_link
source: Website 🧾 Privacy Policy & App Info
vi: Website 🧾 Chính sách quyền riêng tư & Thông tin ứng dụng

# selected_busy_hours
source: Busy time selected
vi: Giờ bận đã chọn

# todo_add_placeholder
source: Add personal todo
vi: Thêm việc cá nhân

# todo_mark_undone
source: Mark as undone
vi: Bỏ đánh dấu hoàn thành

# todo_unpin
source: Unpin
vi: Bỏ ghim
